*****************************************************************
*                                                               *
*     GNAAAAAAAA                                                *
*                                                               *
*****************************************************************
01 CLIENT.
  03 CLIENT-COMMON-INFOS.
    05 FIRSTNAME                       PIC X(18).
    05 LASTNAME                        PIC X(12).
  03 CLIENT-ADVANCED-INFOS.
    05 GENDER                          PIC X(2).
    05 AGE                             PIC X(3).
