*****************************************************************
*                                                               *
*     GNAAAAAAAA                                                *
*                                                               *
*****************************************************************
01 CLIENT.
  03 CLIENT-COMMON-INFOS.
    05 FIRSTNAME                        PIC X(18).
    05 LASTNAME                         PIC X(12).
    05 GENDER                            PIC X(1).
        88 GENDER-MALE                  VALUE 'M'.
        88 GENDER-MALE                  VALUE 'F'.
