*****************************************************************
*                                                               *
*     GNAAAAAAAA                                                *
*                                                               *
*****************************************************************
01 CLIENT.
  03 CLIENT-COMMON-INFOS.
    05 FIRSTNAME                       PIC X(18).
    05 LASTNAME                        PIC X(12).
  03 SIGNEDFLOAT                         PIC S9(13)V99.
  03 SIGNEDINT                         PIC S9(13).
  03 PIC-X                             PIC X.
  03 DUPLICATE                             PIC X.
  03 DUPLICATE                             PIC X.
  03 DUPLICATE                             PIC X.
  03 ELSE                              PIC X(18).
